In [3]:
import numpy as np
import pandas as pd

In [7]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [9]:
#unique values
df['col2'].unique()

array([444, 555, 666])

In [10]:
#count unique values
df['col2'].nunique()

3

In [11]:
#times unique value occurs
df['col2'].value_counts()

444    2
666    1
555    1
Name: col2, dtype: int64

In [13]:
df[df['col2']>580]

   col1  col2 col3
2     3   666  ghi

In [16]:
def times10(x):
    return x*10

In [17]:
df['col1'].apply(times10)

0    10
1    20
2    30
3    40
Name: col1, dtype: int64

In [18]:
df['col1'].apply(lambda x:x*10)

0    10
1    20
2    30
3    40
Name: col1, dtype: int64

In [20]:
df.drop('col1', axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [24]:
#sorting
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [25]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [27]:
data2 = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df2 = pd.DataFrame(data2)

In [28]:
df2

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1